{
  "session_id": "05020b6c-51dc-4195-bf34-87d216add3ba",
  "user_id": "user",
  "created_at": "2025-12-17T18:42:27.106134",
  "original_request": "Vingroup exports software services to clients in the United States. What conditions must be satisfied to apply 0% VAT",
  "suggested_categories": [
    "VAT",
    "CIT",
    "Transfer Pricing"
  ],
  "confirmed_categories": [
    "VAT",
    "CIT",
    "Transfer Pricing"
  ],
  "past_responses_found": [
    {
      "filename": "FCT and VAT implications on loaned equipment-PIC Oanh Pham - MIC Nhung Le.md",
      "content": "The purchase price, in the purchase option stated in Article 15 of the Agreement, will be at a 65% discount from the list price as determined by ABC. No software and/or intellectual property will be transferred by ABC to the distributor upon the disposal of the loaned equipment.\n\nABC assumed all related costs of bringing the loaned equipment physically into Vietnam, including shipping costs, Valued added Tax (“VAT”) and import duties at the import stage, etc. The loaned equipment was delivered by ABC to the distributor in May 2019 with the customs declaration under A11 code for importation procedures (i.e. Import for consumption and for trading). The import VAT was declared and paid to the State Budget based on the list price of the loaned equipment at import stage.\n\nVietnamese Foreign Contractor Tax (“FCT”) and VAT implications on the distributor’s purchase of the loaned equipment; and\n\nThe possibility to apply the relevant tax treaty for tax exemption, where applicable\nPlease advise if any of the above understanding is not correct as it may materially impact our comments hereunder.\nRegulatory basis\nOur comments from tax regulatory perspectives herein have been prepared based on the information and documents provided by you, in accordance with the relevant regulations currently in force in Vietnam as of the reporting date.  Particularly, our comments are mainly based on the legal documents as outlined in Appendix 1.\nImportant note\nWe have been requested to advise on the Vietnamese tax regulatory implications associated with the above arrangements only. Our advice therefore only focuses on current Vietnamese tax and other regulatory regulations of the Socialist Republic of Vietnam and will not take into account (i) legal implications and (ii) tax implications of jurisdictions other than Vietnam. \nOur comments are based on our understanding of the preliminary information that have been provided to us at this stage, in light of the relevant regulations currently in force in Vietnam as of the reporting date. Should there be any changes in the service structure at a later stage, we can assist in updating the comments under a separate engagement.\nOur comments\nFCT and VAT implications\nOverview of Vietnamese taxation\nForeign Contractor Tax (“FCT”) is a comprehensive tax collection regime that applies to, amongst others, foreign business organizations, with or without permanent establishment (“PE”) in Vietnam, doing business in Vietnam or having Vietnam-sourced income on the basis of a contract, agreement or undertaking with Vietnamese organizations. Broadly, FCT is a collection mechanism for Corporate Income Tax (“CIT”) and Value Add Tax (“VAT”).\nConceptually, FCT will not be applied if the goods are supplied with the place of delivery at the border gates, and without accompanied services provided in Vietnam.\nFor goods delivered within the territories of Vietnam, the applicable tax rates for trading activities will be applied at 1% deemed CIT and 1% dee...",
      "summary": "The purchase price, in the purchase option stated in Article 15 of the Agreement, will be at a 65% discount from the list price as determined by ABC. No software and/or intellectual property will be transferred by ABC to the distributor upon the disp",
      "categories": [
        "VAT",
        "CIT",
        "Transfer Pricing"
      ],
      "files_used": [
        "FCT and VAT implications on loaned equipment-PIC Oanh Pham - MIC Nhung Le.md"
      ],
      "date_created": "Unknown"
    },
    {
      "filename": "CIT for share subscription at premium-[Nguyen Thanh Tam]-[Nguyen Duc Thanh].md",
      "content": "Based on another private ruling which was not made public issued by Ho Chi Minh City Tax Department dated 29 January 2021, Investor 1 (Singapore) invested in Investee (Vietnam) with premium. The premium was shared to Investor 2 (BVI), and Investor 2 duly paid tax in Vietnam. Subsequently, Investor 2 contributed such money back into capital contribution in the Investee. The ruling stated that the capital cost when Investor 2 disposes its investment would include such premium value.",
      "summary": "Based on another private ruling which was not made public issued by Ho Chi Minh City Tax Department dated 29 January 2021, Investor 1 (Singapore) invested in Investee (Vietnam) with premium. The premium was shared to Investor 2 (BVI), and Investor 2 ",
      "categories": [
        "VAT",
        "CIT",
        "Transfer Pricing"
      ],
      "files_used": [
        "CIT for share subscription at premium-[Nguyen Thanh Tam]-[Nguyen Duc Thanh].md"
      ],
      "date_created": "Unknown"
    },
    {
      "filename": "Real Estate-Vietnam tax implications in relation to the contemplated plan-Nguyen Thanh Tam-To Huu Minh.md",
      "content": "In case of sale/transfer of the assets, JVC is required to declare and pay Value Added Tax (“VAT”) (at the rate of from 5% or 10% depending on the type of assets sold/transferred) and Corporate Income Tax (“CIT”) (at the standard rate of 20%) on the revenue/taxable income generated from the sale/transfer of assets (if any) in accordance with the prevailing laws.\n\nFulfilling tax liabilities and deactivating JVC’s tax code\n\nJVC is required to conduct the following procedure to deactivate the company’s tax code for the purpose of terminating its operations:\n\nNotification on the deactivation of the tax code: JVC shall submit to the tax authority a dossier for deactivation of its tax code which comprises document requesting deactivation of tax code and a copy of the dissolution resolution.\n\nWithin two (2) working days from receipt of required documents for the dissolution of the Company, the tax authority shall issue a written Notification acknowledging that the Company has ceased its operations and is conducting the procedure for deactivating its tax code.\n\nPreparing and submitting the VAT declaration returns\n\nJVC shall submit its VAT declaration returns to the local tax authority till the last periods of its operation.\n\nSame as CIT matters as aforementioned, JVC should make all supporting documents related to its input VAT available before the dissolution date to avoid risk of input VAT being treated non-creditable.\n\nTax audit: When receiving of the sufficient tax finalisation dossiers from JVC, the tax authority is responsible to carry out the procedure for tax audit at the JVC’s premises for the purpose of dissolution of JVC and deactivation of the tax code of JVC. In practice, the actual timing for tax audit depends on the working schedule of the local tax authority and delay is always anticipated in this procedure.\n\nThe transfer of capital in JVC by J-SPC is not subject to VAT and registration fee in Vietnam.",
      "summary": "In case of sale/transfer of the assets, JVC is required to declare and pay Value Added Tax (“VAT”) (at the rate of from 5% or 10% depending on the type of assets sold/transferred) and Corporate Income Tax (“CIT”) (at the standard rate of 20%) on the ",
      "categories": [
        "VAT",
        "CIT",
        "Transfer Pricing"
      ],
      "files_used": [
        "Real Estate-Vietnam tax implications in relation to the contemplated plan-Nguyen Thanh Tam-To Huu Minh.md"
      ],
      "date_created": "Unknown"
    },
    {
      "filename": "CIT incentive for expansion project in IZ - Conditions and requirements.md",
      "content": "Background\nABC Co., Ltd (“the Company”) was incorporated in Vietnam under the Enterprise Registration Certificate (“ERC”) No. xxx dated 28 May 2008 issued by the Business Registration Office of Vinh Phuc Department of Planning and Investment and licensed to carry out the project under Investment Registration Certificate (“IRC”) No. xxx dated 28 May 2008 issued by the Management Board of Vinh Phuc Industrial Zones (the “Original Investment Project” or “OIP”).\nThe OIP’s objectives include (a) manufacturing and selling automotive components and parts for automobiles and motorcycles, and (b) trading raw materials, machines and tools for manufacturing automotive components and parts for automobiles and motorcycles. \nActivity (a) is entitled to Corporate Income Tax (“CIT”) at the preferential rate of 15% in 12 years from the first year it operates (FY08), CIT exemption for 03 years from the first year it generates a taxable profit (FY09-11) and 50% CIT reduction for the 07 succeeding years (FY12-18). That said, no CIT incentive is available for OIP after FY18. \nThe Company applied for the 5th amended IRC dated 1 August 2022 for the increase in the investment capital and the charter capital, changes in project’s objectives and increase in production capacity (the “Expansion Investment Project” or “EIP”).\nThe changes in the project’s objectives include (i) removal of “Trading automotive components and parts for automobiles and motorcycle; Trading raw materials for manufacturing automotive components and parts for automobiles and motorcycles”; and (ii) supplementation of “Exercising the right to import, export, wholesale distribution (without setting up the wholesale outlet), products include: indicators, license plate lights, 4-wheel ceiling lights”.\nThe increase in investment capital, charter capital and production capacity is summarised as follows:\nPer the Company’s confirmation, the increased investment capital is for construction of a new factory (Factory 2), new machinery and technology for manufacturing components and parts for motorcycles. The budgeted value for the EIP is estimated at VND87,707,515,448 with detailed break-down below. In which, In which, the value of buildings and factory per the construction contract No 01/CC105 signed between the Company and the contractor dated 28 June 2022 is VND56,938,680,000.\nBased on the above information, the increase in historical cost of fixed assets of the EIP as compared to that before expansion investment (e.g. the fixed asset value at year-end FY2021 is VND76,176,748,994) would likely be more than 20%.\nOn the above background, the Company is considering whether it can avail the possible CIT incentive applicable to the EIP under the current Vietnamese tax regulations.\nPlease let us know if any of the above information is not correct as it may materially impact our comments hereunder.\nOur comments\nPossible CIT incentive for the Company’s EIP\nOverview of the CIT regulations\nUnder the current CIT regulat...",
      "summary": "Background\nABC Co., Ltd (“the Company”) was incorporated in Vietnam under the Enterprise Registration Certificate (“ERC”) No. xxx dated 28 May 2008 issued by the Business Registration Office of Vinh Phuc Department of Planning and Investment and lice",
      "categories": [
        "VAT",
        "CIT",
        "Transfer Pricing"
      ],
      "files_used": [
        "CIT incentive for expansion project in IZ - Conditions and requirements.md"
      ],
      "date_created": "Unknown"
    },
    {
      "filename": "TP Survey-Tri Ngo-Hai Anh Nguyen-EN-Final.md",
      "content": "Question 6\nOne of the conditions for TP documentation exemption refers to the term “simple functions”.  How can taxpayer determine whether its functions are ‘simple’? \nAnswer\nUnfortunately, Decree 132 does not provide clear definition/guidance for the term “simple functions”.  Nevertheless, it may be helpful to refer to Clause 2d, Article 14 of Decree 132, which states that: \n“Taxpayers doing business by performing their routine functions, without performing strategic decision-making functions and engaging in transactions of low added value comprise production or distribution enterprises which are not exposed to inventory risk or market risk and do not have sales revenue or costs arising from uses of intangible assets, shall not have to incur operating losses arising from these risks.”\nAnnex 1 – Related party definition \nArticle 5 of Decree 132 provides the following definitions on the relationship of related parties:\n“1. Enterprises with associated relations (below referred as “related parties”) mean parties having relations that fall in one of following cases:\na) One party participates directly or indirectly in management or control of or capital contribution to or investment in the other party;\nb) All parties are directly or indirectly managed or controlled or have capital contributed by another party. \n2. The related parties under Clause 1 above are specifically regulated as follows:\na) One enterprise directly or indirectly holds at least 25% of contributed capital of the owner of the other enterprise;\nb) Both enterprises have at least 25% of the owner’s contributed capital held directly or indirectly by another party;\nc) One enterprise which is the biggest shareholder regarding the owner’s contributed capital and directly or indirectly holds at least 10% of total number of shares of the other enterprise;\nd) One enterprise guarantees or gives loans to the other enterprise in any form (including loans from third party which are guaranteed by related party’s financial resources and other financial transactions with the similar nature) provided that such loans account for at least 25% of contributed capital of the owner of the borrowing enterprise and account for over 50% of the total value of medium-term and long-term loans of the borrowing enterprise;\nđ) One enterprise appoints members of the board of management to manage or control the other enterprise provided that the number of members appointed by the former accounts for more than 50% of the total members of the board of management which have the executive power or control of the latter; or a member appointed by the former has the right to make decisions on financial policies or business activities of the latter;\ne) Both enterprises have more than 50% of the number of members of their board of management or have the same member of their boards of management who has the right to make decisions on financial policies or business activities and is appointed by another party;\ng) Two enterprises...",
      "summary": "Question 6\nOne of the conditions for TP documentation exemption refers to the term “simple functions”.  How can taxpayer determine whether its functions are ‘simple’? \nAnswer\nUnfortunately, Decree 132 does not provide clear definition/guidance for th",
      "categories": [
        "VAT",
        "CIT",
        "Transfer Pricing"
      ],
      "files_used": [
        "TP Survey-Tri Ngo-Hai Anh Nguyen-EN-Final.md"
      ],
      "date_created": "Unknown"
    },
    {
      "filename": "TP analysis on losses-Ha Tran-Trang A.md",
      "content": "Thank you for your trust in KPMG services. We refer to our engagement letter dated 20 January 2020 regarding the Ad-hoc Tax and Transfer pricing advisory services (“the Agreement”) between You and KPMG Tax and Advisory Limited (“KPMG”) in respect of tax and transfer pricing implications of the Company’s loss-making position in FY2018-FY2019. We are pleased to provide hereunder our responses to your queries/ concern and recommendations for your perusal.\nBackground information\nCLIENT was established under Investment Registration Certificate (“IRC”) No. XXXXX398729 dated dd mm yy by Hai Phong Economic Zone Authority as a 100% foreign-invested company owned by “the Parent Co”. The Company is primarily engaged in the production of gloves, including leather gloves, sports gloves and other types of gloves. Under the current IRC, CLIENT is entitled to the Corporate Income Tax (“CIT”) incentives of 2-year CIT exemption and 4-year 50% CIT deduction, starting from the first year of having taxable income.\nIn FY2018-FY2019, the Company was in start-up phase and suffered losses. CLIENT is considering several options to treat the losses in compliance with prevailing Vietnamese tax and transfer pricing regulations. The company has raised several questions as follows:\nQuestion 1: How to treat the loss of FY2018? What are the possible solutions?\nQuestion 2: How to prove that prices are in accordance with arm’s length principle?\nQuestion 3: What are potential customs and tax risks that may arise relating to the year-end adjustment in FY2018? Should an adjustment for FY2018 be made?\nQuestion 4: For FY2019, CLIENT’s parent company – has decided to compensate CLIENT on a full cost basis with a mark-up of 5%. Is this rate reasonable? Would the excessive profit be subject to any taxes in Vietnam?\nQuestion 5: What is the proper method to calculate the transfer pricing adjustments when the Company incurred intra-group interest cost?\nGiven this, CLIENT has sought for KPMG’s professional services in addressing the Company’s concerns relating to these options from tax and transfer pricing perspectives.\nUnder our agreed scope of work, we have thoroughly studied questions raised by CLIENT based on prevailing regulations and provided our comments and recommendations hereunder for your perusal. \nLegal basis\nOur comments and advice presented herein are made based on the information provided by CLIENT and the applicable regulations specified in Appendix I.\nOur comments \nFor your ease of information, we provide hereunder our comments and responses beneath your each and every query.\nQuestion 1 - How to treat the loss of FY2018? What are the possible solutions?\nQuestion 3: What are potential customs and tax risks that may arise relating to the year-end adjustment in FY2018? Should an adjustment for FY2018 be made?\nDespite the Company’s recorded accounting loss of USD577,039, the tax loss reported in its 2018 CIT finalization return was USD434,139 after its making CIT adjustment in re...",
      "summary": "Thank you for your trust in KPMG services. We refer to our engagement letter dated 20 January 2020 regarding the Ad-hoc Tax and Transfer pricing advisory services (“the Agreement”) between You and KPMG Tax and Advisory Limited (“KPMG”) in respect of ",
      "categories": [
        "VAT",
        "CIT",
        "Transfer Pricing"
      ],
      "files_used": [
        "TP analysis on losses-Ha Tran-Trang A.md"
      ],
      "date_created": "Unknown"
    }
  ],
  "selected_past_response": null,
  "past_responses_suggested_files": [],
  "documents_found": [],
  "selected_documents": [],
  "synthesized_response": "",
  "verification_report": {},
  "response_with_citations": "",
  "citations": [],
  "approval_status": "pending",
  "current_step": 4
}