{
  "session_id": "5e188db3-2d88-499e-a5ef-899b74ff01ec",
  "user_id": "user",
  "created_at": "2025-12-10T10:32:23.406482",
  "original_request": "Vingroup exports software services to clients in the United States. What conditions must be satisfied to apply 0% VAT",
  "suggested_categories": [
    "VAT",
    "Customs"
  ],
  "confirmed_categories": [
    "VAT",
    "Customs"
  ],
  "past_responses_found": [
    {
      "filename": "FCT and VAT implications on loaned equipment-PIC Oanh Pham - MIC Nhung Le.md",
      "content": "The purchase price, in the purchase option stated in Article 15 of the Agreement, will be at a 65% discount from the list price as determined by ABC. No software and/or intellectual property will be transferred by ABC to the distributor upon the disposal of the loaned equipment.\n\nABC assumed all related costs of bringing the loaned equipment physically into Vietnam, including shipping costs, Valued added Tax (“VAT”) and import duties at the import stage, etc. The loaned equipment was delivered by ABC to the distributor in May 2019 with the customs declaration under A11 code for importation procedures (i.e. Import for consumption and for trading). The import VAT was declared and paid to the State Budget based on the list price of the loaned equipment at import stage.\n\nVietnamese Foreign Contractor Tax (“FCT”) and VAT implications on the distributor’s purchase of the loaned equipment; and\n\nThe possibility to apply the relevant tax treaty for tax exemption, where applicable\nPlease advise if any of the above understanding is not correct as it may materially impact our comments hereunder.\nRegulatory basis\nOur comments from tax regulatory perspectives herein have been prepared based on the information and documents provided by you, in accordance with the relevant regulations currently in force in Vietnam as of the reporting date.  Particularly, our comments are mainly based on the legal documents as outlined in Appendix 1.\nImportant note\nWe have been requested to advise on the Vietnamese tax regulatory implications associated with the above arrangements only. Our advice therefore only focuses on current Vietnamese tax and other regulatory regulations of the Socialist Republic of Vietnam and will not take into account (i) legal implications and (ii) tax implications of jurisdictions other than Vietnam. \nOur comments are based on our understanding of the preliminary information that have been provided to us at this stage, in light of the relevant regulations currently in force in Vietnam as of the reporting date. Should there be any changes in the service structure at a later stage, we can assist in updating the comments under a separate engagement.\nOur comments\nFCT and VAT implications\nOverview of Vietnamese taxation\nForeign Contractor Tax (“FCT”) is a comprehensive tax collection regime that applies to, amongst others, foreign business organizations, with or without permanent establishment (“PE”) in Vietnam, doing business in Vietnam or having Vietnam-sourced income on the basis of a contract, agreement or undertaking with Vietnamese organizations. Broadly, FCT is a collection mechanism for Corporate Income Tax (“CIT”) and Value Add Tax (“VAT”).\nConceptually, FCT will not be applied if the goods are supplied with the place of delivery at the border gates, and without accompanied services provided in Vietnam.\nFor goods delivered within the territories of Vietnam, the applicable tax rates for trading activities will be applied at 1% deemed CIT and 1% dee...",
      "summary": "The purchase price, in the purchase option stated in Article 15 of the Agreement, will be at a 65% discount from the list price as determined by ABC. No software and/or intellectual property will be transferred by ABC to the distributor upon the disp",
      "categories": [
        "VAT",
        "Customs"
      ],
      "files_used": [
        "FCT and VAT implications on loaned equipment-PIC Oanh Pham - MIC Nhung Le.md"
      ],
      "date_created": "Unknown"
    },
    {
      "filename": "Vietnamese tax implications on flash-title transfer transactions inside bonded warehouse.md",
      "content": "No. 2389/TCT-CS for Canon Singapore’s case, OL No. 3997/TCT-CS for Sagawa’s case and OL No. 1474/TCT-DNL for Sabic’s case);\nThe risk of exposing to income tax of this flash-title-transfer transaction, therefore, is considered high.\nThere is no clear mechanism on how to declare and pay taxes on this type of transactions under the current tax regulations. However, the taxing mechanism was guided/mentioned under the above OLs;\nIn practice, the policy makers are becoming well aware of this kind of business model and may insist to tax by carrying out tax audits at the bonded warehouse management or the logistics companies, on the basis that the bonded warehouse managers are required to notify the Customs Office regarding the transfer of ownership of goods stored at the bonded warehouse for management and supervision under the Customs regulations.2\nThe “substance over form principle” was enacted under the Law on Tax Administration 2019 which is effective from 01 July 2020, being the principle applied in tax administration to analyze transactions and business activities of taxpayers to determine the corresponding tax obligations.3\nGiven the above, the absence of taxing mechanism would not reduce the level of tax risk since (i) the transaction is taxable in principle and (ii) a number of OLs have confirmed taxing mechanism in practice. Since the responsibilities to withhold, declare and pay taxes rests with income payment organization (i.e.\nClient TW) in practice, it is recommended that a private ruling should be obtained from the local tax authorities to confirm the tax position of the transaction and the mechanism to declare and pay taxes in Vietnam.",
      "summary": "No. 2389/TCT-CS for Canon Singapore’s case, OL No. 3997/TCT-CS for Sagawa’s case and OL No. 1474/TCT-DNL for Sabic’s case);\nThe risk of exposing to income tax of this flash-title-transfer transaction, therefore, is considered high.\nThere is no clear ",
      "categories": [
        "VAT",
        "Customs"
      ],
      "files_used": [
        "Vietnamese tax implications on flash-title transfer transactions inside bonded warehouse.md"
      ],
      "date_created": "Unknown"
    },
    {
      "filename": "Tax and Customs implication on goods trading via bonded warehouse.md",
      "content": "Private and confidential\n\nWarranty / Maintenance Work in Vietnam related to the above goods supply\nFor the warranty which is conducted within effective period of the warranty term for free of charge and maintenance services for which ABC Company would charge their customers, ABC Company is considering either of the following options:\nOption 1: ABC Company engages a local ABC company to carry out the warranty / maintenance work and would pay the local ABC company all related expenses, including visa application and salary payments, labor and health insurance expenses for the involved personnel.\nOption 2: ABC Company engages a local agency to carry out the warranty / maintenance work, and would pay the local agency all related expenses, including visa application and salary payments, labor and health insurance expenses for the involved personnel.\nThe involved personnel are directly engaged into the employment relationship with local ABC company / local agency, but not ABC Company.\nLocal ABC company / local agency would issue invoices to charge fees to ABC Company, meanwhile ABC Company would directly issue the invoices to charge maintenance fee to the Vietnam customers.\nKPMG’s comments\nVietnam Tax Perspective\nVietnam tax implications to ABC Company, including but not limited to Vietnam withholding tax (“WHT”), value added tax (“VAT”), personal income tax (“PIT”) obligations\nWHT implications to ABC Company for M&E sales through Vietnam BWH\nVietnam tax system imposes WHT on foreign contractors who do not have a tax presence in Vietnam but earn income from Vietnam. WHT comprise of Corporate Income Tax (“CIT”) and Value Added Tax (“VAT”).\nUnder the current regulations, a foreign contractor shall be subject to Vietnam WHT in certain cases, including but not limited to:\nForeign contractor supplying goods in Vietnam in the form of on-the-spot import and export and having income arising in Vietnam on the basis of a contract signed by such\n\nforeign contractor with a Vietnam party or carrying out distribution of goods in Vietnam or supply of goods on international commercial terms – Incoterms whereby the seller shall bear risks relating to goods entering into the territory of Vietnam.\nForeign contractor conducting all or part of business or distribution activities for goods or provision of services in Vietnam when the foreign contractor remains the owner of the goods delivered to Vietnam party and is responsible for costs of distribution, advertising, marketing, quality of services or quality of goods delivered to Vietnam party; including the case in which a number of Vietnam parties are authorized or hired to carry out part of distribution services or other services relating to the sale of goods in Vietnam.\nPertaining to the contemplated model, we noted that ABC Company would store its goods in a BWH located in Vietnam. Upon demand request from the Vietnam customers, ABC Company would deliver the goods thereafter and the goods ownership would be transferred...",
      "summary": "Private and confidential\n\nWarranty / Maintenance Work in Vietnam related to the above goods supply\nFor the warranty which is conducted within effective period of the warranty term for free of charge and maintenance services for which ABC Company woul",
      "categories": [
        "VAT",
        "Customs"
      ],
      "files_used": [
        "Tax and Customs implication on goods trading via bonded warehouse.md"
      ],
      "date_created": "Unknown"
    }
  ],
  "selected_past_response": null,
  "past_responses_suggested_files": [],
  "documents_found": [
    {
      "filename": "Doc_Undated_ANNEX_8_D_KR.md",
      "category": "tax regulations",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated ANNEX 8 D KR\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/9. Vietnam - Han Quoc/Annex 8/Annex 8\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\nANNEX 8-D\nSCHEDULE OF SPECIFIC COMMITMENTS\nKOREA1\n1 For the purposes of this Agreement, nothing in a Party’s Schedule of Specific Commitments annexed to Chapter on Trade in Services shall be construed to offer the other\nParty any treatment less favorable than the respective treatment in the corresponding Schedule of Specific Commitment annexed to Korea-ASEAN Trade in Services\nAgreement under the Framework Agreement on Comprehensive Economic Cooperation among the Governments of the Republic of Korea and the Member Countries of the\nAssociation of Southeast Asian Nations.\n1\nModes of Supply: 1) Cross-border supply 2) Consumption abroad 3) Commercial presence 4) Presence of natural persons\nSector or Sub-sector Limitations on Market Access Limitations on National Treatment Additional Commitments\nI. HORIZONTAL COMMITMENTS\n* : An asterisk on the CPC(UN provisional Central Product Classification : Statistical Papers Series M No. 77, Department of International Economic and Social\nAffairs, Statistical Office of the United Nations, New York, 1991) code number indicates that the corresponding service sub-sector in this Schedule only covers a\npart or parts of the service sub-sector classified under the given CPC code number.\n“Unbound*” means unbound due to lack of technical feasibility.\nALL SECTORS\nINCLUDED IN THIS 3) The acquisition of outstanding stocks of 3) The acquisition of land is unbound 3) Residents who have\nSCHEDULE existing domestic companies in such areas as except: been treated as\nenergy and aviation by natural person or foreigners in the\njuridical persons of Viet Nam may be (i) that the acquisition of land by Financial Investment\nrestricted. The foreign investment in newly companies which are not deemed as Services and Capital\nprivatized companies may be restricted. foreign under the Foreigner’s Land Markets Act are\nAcquisition Act is permitted, and accorded national\ntreatment in portfolio\n(ii) that the acquisition of land by investment in Korean\ncompanies which are deemed as stocks.\nforeign under the Foreigner’s Land\nAcquisition Act and branches of\nforeign company is permitted, subject\nto approval or notification in\naccordance with the Foreigner’s\nLand Acquisition Act, for the\nfollowing legitimate business\npurposes:\n land used for supplying services\nduring the course of normal business\nactivities;\n land used for housing senior\ncompany personnel under pertinent\nlaws; and\n land used for fulfilling land-holding\nrequirements stipulated by pertinent\nlaws.\n2\nModes of Supply: 1) Cross-border supply 2) Consumption abroad 3) Commercial presence 4) Presence of natural persons\nSector or Sub-sector Limitations on Market Access Limitations on National Treatment Additional Commitments\nEligibility for subsidies, including tax\nbenefits, may be lim",
      "summary": "---\ntitle: \"Doc Undated ANNEX 8 D KR\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/9. Vietnam - Han Quoc/Annex 8/Annex 8\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\nANNEX 8-D\nSCHEDULE OF SPECIFIC COMMI"
    },
    {
      "filename": "Doc_Undated_ANNEX_8_D_VN.md",
      "category": "tax regulations",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated ANNEX 8 D VN\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/9. Vietnam - Han Quoc/Annex 8/Annex 8\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\nANNEX 8-D\nSCHEDULE OF SPECIFIC COMMITMENTS\nVIET NAM1\n1 For the purposes of this Agreement, nothing in a Party’s Schedule of Specific Commitments annexed to Chapter on Trade in Services shall be construed to offer the other Party any\ntreatment less favorable than the respective treatment in the corresponding Schedule of Specific Commitments annexed to Korea-ASEAN Trade in Services Agreement under the\nFramework Agreement on Comprehensive Economic Cooperation among the Governments of the Republic of Korea and the Member Countries of the Association of Southeast Asian\nNations.\nMode of delivery: (1) Cross-border supply (2) Consumption abroad (3) Commercial presence (4) Presence of natural person\nSectors and sub-sectors Limitations on Market Access Limitations on National Treatment Additional Commitments P\na\nI. HORIZONTAL COMMITMENTS g\ne\nALL SECTORS INCLUDED IN THIS (3) None, except: (3) None, except: 2\nSCHEDULE\nUnless otherwise specified in each Eligibility for subsidies may be\nspecific sector or sub-sector of this limited to Vietnamese service\nSchedule, foreign enterprises are suppliers, i.e. to juridical persons\nallowed to establish commercial established within the territory of\npresence in Viet Nam in the form of Viet Nam, or a part thereof. The\nbusiness co-operation contract2, granting of one-time subsidization\njoint venture enterprise, 100% to promote and facilitate the process\nforeign-invested enterprise. of equitization is not in breach of\nthis commitment. Unbound for\nRepresentative offices of foreign subsidies for Research and\nservice suppliers are permitted to be Development. Unbound for\nestablished in Viet Nam, but they subsidies in the Health, Education\nshall not engage in any direct profit- and Audio-visual sectors. Unbound\nmaking activities3. for subsidies aimed at promoting the\nwelfare and employment of ethnic\nUnless otherwise indicated in each minorities.\nspecific sector or sub-sector of this\nSchedule, the establishment of\nbranches is unbound.\nThe conditions of ownership,\noperation and juridical form and\nscope of activities as set out in the\nrespective licenses or other form of\napproval establishing or authorizing\nthe operation or supply of services\nby an existing foreign service\nsupplier shall not be made more\nrestrictive than they exist as of the\ndate of entry into force of this\nAgreement.\n2 Business co-operation contract is a document which is signed by two or more parties (of which at least one party must be Vietnamese legal entity and one party must be foreign legal entity) and\nwhich stipulates the responsibilities of, and the sharing of business results between, the parties for the purpose of conducting investment and business in Viet Nam without creating a legal entity.\n3 Representative office is a subordinate unit of f",
      "summary": "---\ntitle: \"Doc Undated ANNEX 8 D VN\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/9. Vietnam - Han Quoc/Annex 8/Annex 8\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\nANNEX 8-D\nSCHEDULE OF SPECIFIC COMMI"
    },
    {
      "filename": "Doc_Undated_FTA_Vietnam_EEU.md",
      "category": "tax regulations",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated FTA Vietnam EEU\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\nFREE TRADE AGREEMENT BETWEEN\nTHE SOCIALIST REPUBLIC OF VIET NAM, OF THE ONE PART, AND THE EURASIAN\nECONOMIC UNION AND ITS MEMBER STATES,\nOF THE OTHER PART\nPREAMBLE\nThe Socialist Republic of Viet Nam (hereinafter referred to as “Viet Nam”),\nof the one part, and the Republic of Armenia, the Republic of Belarus, the\nRepublic of Kazakhstan, the Kyrgyz Republic, the Russian Federation\n(hereinafter referred to as “the Member States of the Eurasian Economic\nUnion”), and the Eurasian Economic Union, of the other part:\nRECOGNISING the importance of enhancing their longstanding and strong\nfriendship and the traditional multi-faceted cooperation between the Parties;\nDESIRING to create favourable conditions for the development and\ndiversification of trade between them and for the promotion of commercial and\neconomic cooperation in areas of common interest on the basis of equality,\nmutual benefit, non-discrimination and international law;\nREAFFIRMING their respective rights and obligations under the Marrakesh\nAgreement Establishing the World Trade Organization and other existing\ninternational agreements to which the Parties are party;\nRECOGNISING the need to uphold the principles and practices which promote\nfree and unhindered trade in a stable, transparent and non-discriminatory manner;\nCONVINCED that this Agreement will enhance the competitiveness of the\neconomies of the Parties in global markets and create conditions encouraging\neconomic, trade and investment relations between them;\nBEING CONSCIOUS of the importance of trade facilitation in promoting\nefficient and transparent procedures to reduce costs and ensure predictability;\n2\nEMPHASISING the complementarities of the economies of the Parties and the\nsignificant potential to advance economic relations by further developing the\nframework for trade and investment;\nACKNOWLEDGING the important role and contribution of investments in\nenhancing trade and cooperation between the Parties and the need to further\npromote and facilitate cooperation and greater business opportunities provided by\nthis Agreement;\nREAFFIRMING the importance of ongoing economic cooperation initiatives\nbetween the Parties, and agreeing to further develop the existing economic\npartnership in areas where the Parties have mutual interests;\nDESIRING to eliminate barriers to trade and investment between the Parties,\nlower business costs and enhance economic efficiency; and\nCONVINCED that joint efforts between the Parties towards an advanced free\ntrade agreement will develop an enhanced framework for the promotion and\ndevelopment of economic and trade relations between Viet Nam and the Member\nStates of the Eurasian Economic Union in their common interest and for their\nmutual benefit;\nHAVE AGREED as follows:\n3\nCHAPTER 1\nGENERAL PROVISIONS\nARTICLE 1.1",
      "summary": "---\ntitle: \"Doc Undated FTA Vietnam EEU\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\nFREE TRADE AGREEMENT BETWEEN\nTHE SOCIALIST REPUBLIC O"
    },
    {
      "filename": "Doc_Undated_vcufta__annex_1_c_trq_eggsv.md",
      "category": "tax regulations",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated vcufta  annex 1 c trq eggsv\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\n636\nNOTE ON TARIFF RATE QUOTAS FOR EGGS EXPORTED TO VIET NAM\n1. The following within-quota tariff reduction, which shall be done in three equal\nannual instalments to free, shall be applied to eggs originating in the Member\nStates of the Eurasian Economic Union exported to Viet Nam in accordance\nwith this Note.\n2. Viet Nam shall accord to the Member States of the Eurasian Economic Union\nthe total annual import quota of 8 000 dozen for eggs originating in the\nMember States of the Eurasian Economic Union, which shall be separate from\nthe quantity of Viet Nam’s tariff rate quotas for eggs under its WTO\ncommitments.\n3. The out-of-quota tariff rate shall be applied in accordance with the domestic\nlaws and regulations of Viet Nam on tariff rate quotas and pursuant to Article\n2.1 of this Agreement.\n4. The annual growth rate of quota quantity is five percent.\nRate of\ncustoms\nRate of customs duty within quota\nduty out of\nQuota\nHS Code Description quota\nquantity\n2018 and\nEIF 2016 2017 subsequent\nyears\n0407.21.00\nEggs of fowls\n0407.90.10\n8 000\n0407.29.10\nEggs of ducks dozens 22,5% 15% 7,5% 0% U\n0407.90.20\nper year\n0407.29.90\nOther eggs\n0407.90.90",
      "summary": "---\ntitle: \"Doc Undated vcufta  annex 1 c trq eggsv\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\n636\nNOTE ON TARIFF RATE QUOTAS FOR EGGS E"
    },
    {
      "filename": "Doc_Undated_vcufta__annex_1_d_trq_tobaccov.md",
      "category": "tax regulations",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated vcufta  annex 1 d trq tobaccov\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\n637\nNOTE ON TARIFF RATE QUOTAS FOR UNMANUFACTURED TOBACCO AND\nTOBACCO REFUSE EXPORTED TO VIET NAM\n1. The following within-quota tariff reduction, which shall be done in five\nannual instalments to free, shall be applied to unmanufactured tobacco and\ntobacco refuse originating in the Member States of the Eurasian Economic\nUnion exported to Viet Nam in accordance with this Note.\n2. Viet Nam shall accord to the Member States of the Eurasian Economic\nUnion the total annual import quota of 500 tonnes for unmanufactured\ntobacco and tobacco refuse originating in the Member States of the Eurasian\nEconomic Union, which shall be in accordance with Viet Nam's\ninternational commitments and respective domestic laws and regulations on\nthose tariff rate quota products.\n3. The out-of-quota tariff rate shall be applied in accordance with the domestic\nlaws and regulations of Viet Nam on tariff rate quotas and pursuant to\nArticle 2.1 of this Agreement.\n638\nRate of customs duty within quota Rate of\nQuota customs\nHS Code Description 2020 and\nquantity duty out of\nEIF 2016 2017 2018 2019 subsequent\nquota\nyears\n- - Virginia type,\n2401.10.10 10% 7% 5% 5% 3% 0% U\nflue-cured\n- - Virginia type,\n2401.10.20 other than 10% 7% 5% 5% 3% 0% U\nflue-cured\n2401.10.90 - - Other 10% 7% 5% 5% 3% 0% U\n- - Virginia type,\n2401.20.10 10% 7% 5% 5% 3% 0% U\nflue-cured\n500\n- - Virginia type,\ntonnes\n2401.20.20 other than 10% 7% 5% 5% 3% 0% U\nper year\nflue-cured\n2401.20.30 - - Oriental type 10% 7% 5% 5% 3% 0% U\n2401.20.40 - - Burley type 10% 7% 5% 5% 3% 0% U\n2401.20.50 - - Other, flue-cured 10% 7% 5% 5% 3% 0% U\n2401.20.90 - - Other 10% 7% 5% 5% 3% 0% U\n2401.30.10 - - Tobacco stems 5% 5% 5% 5% 3% 0% U\n2401.30.90 - - Other 10% 7% 5% 5% 3% 0% U",
      "summary": "---\ntitle: \"Doc Undated vcufta  annex 1 d trq tobaccov\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\n637\nNOTE ON TARIFF RATE QUOTAS FOR UNM"
    },
    {
      "filename": "Doc_Undated_vcufta__annex_1_f_trq_ricev.md",
      "category": "tax regulations",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated vcufta  annex 1 f trq ricev\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\n849\nNOTE ON TARIFF RATE QUOTAS FOR RICE EXPORTED\nTO THE EURASIAN ECONOMIC UNION\n1. The following within-quota tariff reduction shall be applied to rice originating\nin Viet Nam exported to the Eurasian Economic Union in accordance with this\nNote.\n2. The Eurasian Economic Union shall accord to Viet Nam the total annual\nimport quota of 10 000 tonnes for rice originating in Viet Nam.\n3. The out-of-quota tariff rate shall be applied in accordance with the respective\nlaws and regulations of the Eurasian Economic Union on tariff rate quotas and\npursuant to Article 2.1 of this Agreement.\nRate of Rate of\nQuota customs customs\nHS Code Description\nquantity duty within duty out\nquota of quota\nParboiled long grain rice\n1006 30 670 0 of a length/width ratio 0% U\nequal to or greater than 3 10 000\ntonnes\nOther long grain rice of a per year\n1006 30 980 0 length/width ratio equal 0% U\nto or greater than 3",
      "summary": "---\ntitle: \"Doc Undated vcufta  annex 1 f trq ricev\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\n849\nNOTE ON TARIFF RATE QUOTAS FOR RICE E"
    },
    {
      "filename": "Doc_Undated_vcufta__annex_5.md",
      "category": "tax regulations",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated vcufta  annex 5\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\nANNEX 5\nCERTIFICATE OF ORIGIN\n1. Exporter (business name, address and 4. No. ________\ncountry)\nEAEU-VN FTA\nCertificate of Origin\nForm EAV\n2. Importer/Consignee (business name,\nIssued in\naddress and country)\n________________________________________\n(country)\nFor submission to\n________________________________________\n(country)\n3. Means of transport and route (as far as 5. For official use\nknown)\n6. Item No. 7. Number 8. Description 9. Origin criterion 10. Quantity 11. Number\nand kind of goods of goods and date of\nof invoice\npackages\n12. Certification 13. Declaration by the applicant\nIt is hereby certified, on the basis The undersigned hereby declares\nof control carried out, that the that the above details are correct,\ndeclaration by the applicant is correct. that all goods were produced in\n____________________________________\n(country)\nand that they comply with the rules of origin\nas provided for in Chapter 4 (Rules of Origin)\nof the EAEU-VN FTA\nPlace Date Signature Stamp Place Date Signature Stamp\n2\nAdditional Sheet of Certificate of Origin (Form EAV) No. ___\n6. Item No. 7. Number 8. Description 9. Origin 10. Quantity 11. Number\nand kind of goods criterion of goods and date of\nof packages invoice\n12. Certification 13. Declaration by the applicant\nIt is hereby certified, on the basis The undersigned hereby declares\nof control carried out, that the that the above details are correct,\ndeclaration by the applicant is correct. that all goods were produced in\n_____________________________\n(country)\nand that they comply with the rules of origin\nas provided for in Chapter 4 (Rules of Origin)\nof the EAEU-VN FTA\nPlace Date Signature Stamp Place Date Signature Stamp\n3\nInstructions for Completing Certificate of Origin (Form EAV)\nThe Certificate of Origin (Form EAV) and its additional sheets must be on ISO\nA4 size colour paper in conformity with the specimen shown in this Annex. It\nshall be made in the English language.\nUnused spaces in boxes 6 through 11 shall be crossed out to prevent any\nsubsequent addition.\nThe Certificate of Origin shall:\na) be in a hard copy and in conformity with the specimen text set out in\nthis Annex, which shall be printed in the English language;\nb) contain the minimum data required in boxes 1, 2, 4, 7 through 13;\nc) bear a signature of an authorised signatory and official seal of the\nauthorised body and security features. The signature shall be\nhandwritten and official seal shall not be a facsimile.\nBox 1: Enter details of the exporter of the goods: business name, address and\ncountry.\nBox 2: Enter details of the importer of the goods (obligatory) and consignee (if\nknown): business name, address and country.\nBox 3: Enter details of transportation (as far as known) such as departure\n(shipment) date, means of transport (vessel, aircraft, et ",
      "summary": "---\ntitle: \"Doc Undated vcufta  annex 5\"\ncategory: \"Customs\"\nsubcategory: \"Customs & FTA\"\nsource_folder: \"Circulars/FTA/10. Vietnam - EEU\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"pdf\"\n---\n\nANNEX 5\nCERTIFICATE OF ORIGIN\n1. Exporter (business n"
    }
  ],
  "selected_documents": [],
  "synthesized_response": "",
  "verification_report": {},
  "response_with_citations": "",
  "citations": [],
  "approval_status": "pending",
  "current_step": 4
}