{
  "session_id": "76e32fb7-f2ad-4aa3-8c97-632df0f554d3",
  "user_id": "user",
  "created_at": "2025-12-18T12:24:08.830534",
  "original_request": "Vingroup exports software services to clients in the United States. What conditions must be satisfied to apply 0% VAT",
  "suggested_categories": [
    "VAT"
  ],
  "confirmed_categories": [
    "VAT"
  ],
  "past_responses_found": [
    {
      "filename": "FCT and VAT implications on loaned equipment-PIC Oanh Pham - MIC Nhung Le.md",
      "content": "The purchase price, in the purchase option stated in Article 15 of the Agreement, will be at a 65% discount from the list price as determined by ABC. No software and/or intellectual property will be transferred by ABC to the distributor upon the disposal of the loaned equipment.\n\nABC assumed all related costs of bringing the loaned equipment physically into Vietnam, including shipping costs, Valued added Tax (“VAT”) and import duties at the import stage, etc. The loaned equipment was delivered by ABC to the distributor in May 2019 with the customs declaration under A11 code for importation procedures (i.e. Import for consumption and for trading). The import VAT was declared and paid to the State Budget based on the list price of the loaned equipment at import stage.\n\nVietnamese Foreign Contractor Tax (“FCT”) and VAT implications on the distributor’s purchase of the loaned equipment; and\n\nThe possibility to apply the relevant tax treaty for tax exemption, where applicable\nPlease advise if any of the above understanding is not correct as it may materially impact our comments hereunder.\nRegulatory basis\nOur comments from tax regulatory perspectives herein have been prepared based on the information and documents provided by you, in accordance with the relevant regulations currently in force in Vietnam as of the reporting date.  Particularly, our comments are mainly based on the legal documents as outlined in Appendix 1.\nImportant note\nWe have been requested to advise on the Vietnamese tax regulatory implications associated with the above arrangements only. Our advice therefore only focuses on current Vietnamese tax and other regulatory regulations of the Socialist Republic of Vietnam and will not take into account (i) legal implications and (ii) tax implications of jurisdictions other than Vietnam. \nOur comments are based on our understanding of the preliminary information that have been provided to us at this stage, in light of the relevant regulations currently in force in Vietnam as of the reporting date. Should there be any changes in the service structure at a later stage, we can assist in updating the comments under a separate engagement.\nOur comments\nFCT and VAT implications\nOverview of Vietnamese taxation\nForeign Contractor Tax (“FCT”) is a comprehensive tax collection regime that applies to, amongst others, foreign business organizations, with or without permanent establishment (“PE”) in Vietnam, doing business in Vietnam or having Vietnam-sourced income on the basis of a contract, agreement or undertaking with Vietnamese organizations. Broadly, FCT is a collection mechanism for Corporate Income Tax (“CIT”) and Value Add Tax (“VAT”).\nConceptually, FCT will not be applied if the goods are supplied with the place of delivery at the border gates, and without accompanied services provided in Vietnam.\nFor goods delivered within the territories of Vietnam, the applicable tax rates for trading activities will be applied at 1% deemed CIT and 1% dee...",
      "summary": "The purchase price, in the purchase option stated in Article 15 of the Agreement, will be at a 65% discount from the list price as determined by ABC. No software and/or intellectual property will be transferred by ABC to the distributor upon the disp",
      "categories": [
        "VAT"
      ],
      "files_used": [
        "FCT and VAT implications on loaned equipment-PIC Oanh Pham - MIC Nhung Le.md"
      ],
      "date_created": "Unknown"
    }
  ],
  "selected_past_response": null,
  "past_responses_suggested_files": [],
  "documents_found": [
    {
      "filename": "Doc_Undated_06_2012_TTBTC_EN.md",
      "category": "02_VAT",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated 06 2012 TTBTC EN\"\ncategory: \"VAT\"\nsubcategory: \"Value Added Tax\"\nsource_folder: \"Luat ND TT\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"doc\"\n---\n\n--- PAGE 1 ---\nTHE MINISTRY OF FINANCE THE SOCIALIST REPUBLIC OF VIETNAM\n— Independence- Freedom — Happiness\n\nNo: 06/2012/TT-BTC Hanoi, January 11, 2012\n\nCIRCULAR\n\nGUIDING THE IMPLEMENTATION OF A NUMBER OF ARTICLES OF THE LAW ON VALUE-ADDED\nTAX, GUIDING THE IMPLEMENTATION OF THE DECREE NO. 123/2008/ND-CP OF DECEMBER 08,\n2008 AND THE DECREE NO. 121/2011/ND-CP OF DECEMBER 27, 2011 OF THE GOVERNMENT\n\nPursuant to the Law on Value-added Tax No. 13/2008/QH12 of June 03, 2008;\nPursuant to the Law on Tax Administration No. 78/2006/QH11 of November 29, 2006\n\nPursuant to the Government's Decree No. 123/2008/ND-CP of December 08, 2008 detailing and guiding\nthe implementation of a number of articles of the Law on Value-added Tax;\n\nPursuant to the Government's Decree No. 121/2011/ND-CP of December 27, 2011 amending,\nsupplementing a number of articles of the Government's Decree No. 123/2008/ND-CP of December 8,\n2008 detailing and guiding the implementation a number of articles of the Law on Value-added Tax;\n\nPursuant to the Government's Decree No. 118/2008/ND-CP of November 27, 2008 prescribing the\nfunctions, tasks, powers and the organizational structure of the Ministry of Finance,\n\nThe Ministry of Finance guides the implementation of the value-added tax as follows:\nChapter |\n\nGENERAL PROVISIONS\nArticle 1. Scope of regulation\n\nThis Circular prescribes the taxable objects, non-taxable objects, tax payers, foundation and methods to\ncalculate, deduct and refund Value-added tax.\n\nArticle 2. Taxable objects\n\nObjects of Value-added tax (VAT) means goods, services serving production, business and consumption\nin Vietnam (including goods, services purchased from overseas organizations, individuals, except for VAT\nnon-taxable objects guided in Article 4 of this Circular.\n\nArticle 3. Tax payers\n\nVAT payers are organizations, individuals producing, trading VAT taxable goods, services in Vietnam,\nregardless of lines, forms, business organizations (hereinafter referred to as business establishments)\nand organizations, individuals importing goods, purchasing services from foreign countries subject to VAT\n(hereinafter referred to as importers) including:\n\n1. Business organizations established and registered business under the Law on Enterprises, the Law on\nState-owned Enterprises (now the Law on Enterprises), the Law on Cooperatives;\n\n2. Economical organizations of political organizations, socio-political organizations, social organizations,\nsocio-professional organizations, People’s armed force units, non-business organizations and other\norganizations;\n\n3. Foreign-owned enterprises and the foreign parties participating in business cooperation under the Law\non Foreign Investment in Vietnam (now the Law on Investment); foreign organizations, individuals\nconducting business in Vietnam but not establishing",
      "summary": "---\ntitle: \"Doc Undated 06 2012 TTBTC EN\"\ncategory: \"VAT\"\nsubcategory: \"Value Added Tax\"\nsource_folder: \"Luat ND TT\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"doc\"\n---\n\n--- PAGE 1 ---\nTHE MINISTRY OF FINANCE THE SOCIALIST REPUBLIC OF VIETNAM\n— "
    },
    {
      "filename": "Doc_Undated_129_2008_TTBTC.md",
      "category": "02_VAT",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated 129 2008 TTBTC\"\ncategory: \"VAT\"\nsubcategory: \"Value Added Tax\"\nsource_folder: \"Luat ND TT\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"doc\"\n---\n\n--- PAGE 1 ---\nTHE MINISTRY OF FINANCE SOCIALIST REPUBLIC OF VIET NAM\n—— Independence - Freedom - Happiness\n\nNo. 129/2008/TT-BTC Hanoi, December 26, 2008\n\nCIRCULAR\n\nGUIDING THE IMPLEMENTATION OF A NUMBER OF ARTICLES OF THE VALUE-ADDED TAX LAW\nAND GUIDING THE IMPLEMENTATION OF THE GOVERNMENT'S DECREE NO. 123/2008/ND-CP OF\nDECEMBER 8, 2008, DETAILING AND GUIDING THE IMPLEMENTATION OF A NUMBER OF\nARTICLES OF THE VALUE-ADDED TAX LAW\n\nPursuant to Value-Added Tax Law No. 13/2008/QH12 of June 3, 2008;\n\nPursuant to Tax Administration Law No. 78/2006/QH11 of November 29, 2006;\n\nPursuant to the Government's Decree No. 123/2008/ND-CP of December 8, 2008, detailing and guiding\nthe implementation of a number of articles of the Value-Added Tax Law;\n\nPursuant to the Government's Decree No. 118/2008/ND-CP of November 27, 2008, defining the\nfunctions, tasks, powers and organizational structure of the Finance Ministry;\n\nThe Finance Ministry guides implementation of value-added tax (VAT) as follows:\n\nA. SCOPE OF APPLICATION\n|. TAXABLE OBJECTS AND TAXPAYERS\n1. Taxable objects\n\nLiable to VAT are goods and services used for production, business and consumption in Vietnam\n(including goods and services purchased from organizations and individuals abroad), except for those not\nliable to VAT specified in Section II, Part A of this Circular.\n\n2. Taxpayers\n\nVAT payers are organizations and individuals producing and trading in VAT-liable goods and services in\nVietnam, regardless of their business lines, forms and organization (below referred to as business\nestablishments) and organizations and individuals that import goods or purchase services liable to VAT\nfrom abroad (below referred to as importers), including:\n\n2.1. Business organizations established and registering business under the Law on Enterprises, the Law\non State Enterprises (now the Law on Enterprises) or the Law on Cooperatives;\n\n2.2. Economic organizations of political organizations, socio-political organizations, social organizations,\nsocio-professional organizations, people’s armed forces units, non-business organizations and other\norganizations;\n\n2.3. Foreign-invested enterprises and foreign parties to business cooperation contracts under the Law on\nForeign Investment in Vietnam (now the Law on Investment); foreign organizations and individuals\nconducting business activities in Vietnam without establishing legal entities in Vietnam;\n\n2.4. Individuals, households, independent groups of business people and other business entities\nconducting in production, business or import activities.\n\n2.5. Organizations and individuals that conduct production or business in Vietnam and purchase services\n(including services associated with goods) from foreign organizations without permanent establishments\nin Vietnam or overseas individuals who do not resid",
      "summary": "---\ntitle: \"Doc Undated 129 2008 TTBTC\"\ncategory: \"VAT\"\nsubcategory: \"Value Added Tax\"\nsource_folder: \"Luat ND TT\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"doc\"\n---\n\n--- PAGE 1 ---\nTHE MINISTRY OF FINANCE SOCIALIST REPUBLIC OF VIET NAM\n—— Inde"
    },
    {
      "filename": "Doc_Undated_129_2008_TTBTC_EN.md",
      "category": "02_VAT",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated 129 2008 TTBTC EN\"\ncategory: \"VAT\"\nsubcategory: \"Value Added Tax\"\nsource_folder: \"Luat ND TT\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"doc\"\n---\n\n--- PAGE 1 ---\nTHE MINISTRY OF FINANCE SOCIALIST REPUBLIC OF VIET NAM\n—— Independence - Freedom - Happiness\n\nNo. 129/2008/TT-BTC Hanoi, December 26, 2008\n\nCIRCULAR\n\nGUIDING THE IMPLEMENTATION OF A NUMBER OF ARTICLES OF THE VALUE-ADDED TAX LAW\nAND GUIDING THE IMPLEMENTATION OF THE GOVERNMENT'S DECREE NO. 123/2008/ND-CP OF\nDECEMBER 8, 2008, DETAILING AND GUIDING THE IMPLEMENTATION OF A NUMBER OF\nARTICLES OF THE VALUE-ADDED TAX LAW\n\nPursuant to Value-Added Tax Law No. 13/2008/QH12 of June 3, 2008;\n\nPursuant to Tax Administration Law No. 78/2006/QH11 of November 29, 2006;\n\nPursuant to the Government's Decree No. 123/2008/ND-CP of December 8, 2008, detailing and guiding\nthe implementation of a number of articles of the Value-Added Tax Law;\n\nPursuant to the Government's Decree No. 118/2008/ND-CP of November 27, 2008, defining the\nfunctions, tasks, powers and organizational structure of the Finance Ministry;\n\nThe Finance Ministry guides implementation of value-added tax (VAT) as follows:\n\nA. SCOPE OF APPLICATION\n|. TAXABLE OBJECTS AND TAXPAYERS\n1. Taxable objects\n\nLiable to VAT are goods and services used for production, business and consumption in Vietnam\n(including goods and services purchased from organizations and individuals abroad), except for those not\nliable to VAT specified in Section II, Part A of this Circular.\n\n2. Taxpayers\n\nVAT payers are organizations and individuals producing and trading in VAT-liable goods and services in\nVietnam, regardless of their business lines, forms and organization (below referred to as business\nestablishments) and organizations and individuals that import goods or purchase services liable to VAT\nfrom abroad (below referred to as importers), including:\n\n2.1. Business organizations established and registering business under the Law on Enterprises, the Law\non State Enterprises (now the Law on Enterprises) or the Law on Cooperatives;\n\n2.2. Economic organizations of political organizations, socio-political organizations, social organizations,\nsocio-professional organizations, people’s armed forces units, non-business organizations and other\norganizations;\n\n2.3. Foreign-invested enterprises and foreign parties to business cooperation contracts under the Law on\nForeign Investment in Vietnam (now the Law on Investment); foreign organizations and individuals\nconducting business activities in Vietnam without establishing legal entities in Vietnam;\n\n2.4. Individuals, households, independent groups of business people and other business entities\nconducting in production, business or import activities.\n\n2.5. Organizations and individuals that conduct production or business in Vietnam and purchase services\n(including services associated with goods) from foreign organizations without permanent establishments\nin Vietnam or overseas individuals who do not re",
      "summary": "---\ntitle: \"Doc Undated 129 2008 TTBTC EN\"\ncategory: \"VAT\"\nsubcategory: \"Value Added Tax\"\nsource_folder: \"Luat ND TT\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"doc\"\n---\n\n--- PAGE 1 ---\nTHE MINISTRY OF FINANCE SOCIALIST REPUBLIC OF VIET NAM\n—— I"
    },
    {
      "filename": "Doc_Undated_219_2013_TTBTC_EN.md",
      "category": "02_VAT",
      "subcategory": "General",
      "size": "Unknown",
      "date_issued": "Unknown",
      "content": "---\ntitle: \"Doc Undated 219 2013 TTBTC EN\"\ncategory: \"VAT\"\nsubcategory: \"Value Added Tax\"\nsource_folder: \"Luat ND TT\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"doc\"\n---\n\n--- PAGE 1 ---\nTHE MINISTRY OF FINANCE THE SOCIALIST REPUBLIC OF VIETNAM\n———---= Independence - Freedom - Happiness\n\nNo. 219/2013/TT-BTC Hanoi, December 31, 2013\n\nCIRCULAR\n\nGUIDING THE IMPLEMENTATION OF THE LAW ON VALUE-ADDED TAX AND THE\nGOVERNMENT'S DECREE NO. 209/2013/ND-CP OF DECEMBER 18, 2013, DETAILING\nAND GUIDING A NUMBER OF ARTICLES OF THE LAW ON VALUE-ADDED TAX’\n\nPursuant to June 3, 2008 Law No. 13/2008/QH12 on Value-Added Tax, and June 19, 2013\nLaw No. 31/2013/QH13 Amending and Supplementing a Number of Articles of the Law on\nValue-Added Tax;\n\nPursuant to November 29, 2006 Law No. 78/2006/QH11 on Tax Administration, and\n\nNovember 20, 2012 Law No. 21/2012/QH13 Amending and Supplementing a Number of\nArticles of the Law on Tax Administration;\n\nPursuant to the Government's Decree No. 209/2013/ND-CP of December 18, 2013, detailing\nand guiding a number of articles of the Law on Value-Added Tax;\n\nPursuant to the Government's Decree No. 118/2008/ND-CP of November 27, 2008, defining\nthe functions, tasks, powers and organizational structure of the Ministry of Finance;\n\nAt the proposal of the General Director of Taxation,\nThe Minister of Finance guides the implementation of value-added tax as follows:\nChapter |\nGENERAL PROVISIONS\nArticle 1. Scope of regulation\n\nThis Circular guides taxable objects, non-taxable objects, taxpayers, tax bases and tax\ncalculation methods, and credit, refund and places of payment of value-added tax.\n\nArticle 2. Taxable objects\n\nLiable to value-added tax (VAT) are goods and services used for production, business and\nconsumption in Vietnam (including goods and services purchased from overseas\norganizations and individuals), except those not liable to VAT guided in Article 4 of this\nCircular.\n\nArticle 3. Taxpayers\n\nVAT payers are organizations and individuals producing or trading in VAT-liable goods and\nservices in Vietnam, regardless of their business lines, forms and organization (below\nreferred to as business establishments) and organizations and individuals that import from\nabroad goods or purchase services liable to VAT (below referred to as importers), including:\n\n1. Business organizations established and making business registration under the Enterprise\nLaw, the Law on State Enterprises (now the Enterprise Law), the Law on Cooperatives or\nanother specialized business law;\n\n2. Economic organizations of political organizations, socio-political organizations, social\norganizations, socio-professional organizations, people’s armed forces units, non-business\norganizations and other organizations;\n\n3. Foreign-invested enterprises and foreign parties to business cooperation contracts under\nthe Law on Foreign Investment in Vietnam (now the Investment Law); foreign organizations\nand individuals conducting business activities in Vietnam without establish",
      "summary": "---\ntitle: \"Doc Undated 219 2013 TTBTC EN\"\ncategory: \"VAT\"\nsubcategory: \"Value Added Tax\"\nsource_folder: \"Luat ND TT\"\nconversion_date: \"2025-11-21\"\noriginal_format: \"doc\"\n---\n\n--- PAGE 1 ---\nTHE MINISTRY OF FINANCE THE SOCIALIST REPUBLIC OF VIETNAM\n—"
    }
  ],
  "selected_documents": [
    "Doc_Undated_06_2012_TTBTC_EN.md",
    "Doc_Undated_129_2008_TTBTC.md",
    "Doc_Undated_129_2008_TTBTC_EN.md",
    "Doc_Undated_219_2013_TTBTC_EN.md"
  ],
  "synthesized_response": "KPMG TAX MEMORANDUM\n\n**Background**\nVingroup exports software services to clients in the United States and seeks to apply a 0% Value-Added Tax (VAT) rate. To determine the conditions for applying this rate, we must examine the relevant Vietnamese regulations.\n\n**Regulatory Understanding**\nAccording to [Doc_Undated_06_2012_TTBTC_EN.md], the Ministry of Finance guides the implementation of the Law on Value-Added Tax, which prescribes the taxable objects, non-taxable objects, tax payers, and methods to calculate, deduct, and refund VAT. Specifically, Article 2 of [Doc_Undated_06_2012_TTBTC_EN.md] states that objects of VAT include goods and services serving production, business, and consumption in Vietnam, except for VAT non-taxable objects.\n\nAccording to [Doc_Undated_129_2008_TTBTC_EN.md], VAT payers are organizations and individuals producing and trading in VAT-liable goods and services in Vietnam, including business organizations, economic organizations, foreign-invested enterprises, and individuals conducting production or business in Vietnam. Additionally, [Doc_Undated_129_2008_TTBTC_EN.md] states that liable to VAT are goods and services used for production, business, and consumption in Vietnam, including goods and services purchased from organizations and individuals abroad.\n\n**Analysis**\nTo apply a 0% VAT rate, Vingroup must meet the conditions specified in the regulations. However, the source documents do not explicitly state the conditions for applying a 0% VAT rate for exported software services. According to [Doc_Undated_219_2013_TTBTC_EN.md], this Circular guides taxable objects, non-taxable objects, taxpayers, tax bases, and tax calculation methods, but it does not provide specific guidance on the conditions for applying a 0% VAT rate.\n\n**Recommendations**\nBased on the analysis, we recommend that Vingroup review the relevant regulations and seek guidance from the tax authorities to determine the specific conditions for applying a 0% VAT rate for exported software services. According to [Doc_Undated_06_2012_TTBTC_EN.md], the Ministry of Finance guides the implementation of the Law on Value-Added Tax, and it is essential to follow the official guidance and regulations.\n\n**Risks**\nIf Vingroup fails to meet the conditions for applying a 0% VAT rate, it may be subject to penalties and interest on underpaid taxes. According to [Doc_Undated_129_2008_TTBTC_EN.md], VAT payers are responsible for paying VAT on taxable goods and services, and failure to comply with the regulations may result in tax liabilities.\n\n**Sources**\n* [Doc_Undated_06_2012_TTBTC_EN.md]\n* [Doc_Undated_129_2008_TTBTC_EN.md]\n* [Doc_Undated_219_2013_TTBTC_EN.md]\n\nNote: The source documents do not address the specific conditions for applying a 0% VAT rate for exported software services. Therefore, we cannot provide a definitive answer to the client's request. We recommend seeking guidance from the tax authorities to ensure compliance with the regulations.",
  "verification_report": {},
  "response_with_citations": "\nKPMG TAX MEMORANDUM\n\n**Background**\nVingroup exports software services to clients in the United States and seeks to apply a 0% Value-Added Tax (VAT) rate [Source: Doc_Undated_06_2012_TTBTC_EN.md]. To determine the conditions for applying this rate, we must examine the relevant Vietnamese regulations [Source: Doc_Undated_06_2012_TTBTC_EN.md].\n\n**Regulatory Understanding**\nAccording to [Doc_Undated_06_2012_TTBTC_EN.md], the Ministry of Finance guides the implementation of the Law on Value-Added Tax, which prescribes the taxable objects, non-taxable objects, tax payers, and methods to calculate, deduct, and refund VAT [Source: Doc_Undated_06_2012_TTBTC_EN.md]. Specifically, Article 2 of [Doc_Undated_06_2012_TTBTC_EN.md] states that objects of VAT include goods and services serving production, business, and consumption in Vietnam, except for VAT non-taxable objects [Source: Doc_Undated_06_2012_TTBTC_EN.md].\n\nAccording to [Doc_Undated_129_2008_TTBTC_EN.md], VAT payers are organizations and individuals producing and trading in VAT-liable goods and services in Vietnam, including business organizations, economic organizations, foreign-invested enterprises, and individuals conducting production or business in Vietnam [Source: Doc_Undated_129_2008_TTBTC_EN.md]. Additionally, [Doc_Undated_129_2008_TTBTC_EN.md] states that liable to VAT are goods and services used for production, business, and consumption in Vietnam, including goods and services purchased from organizations and individuals abroad [Source: Doc_Undated_129_2008_TTBTC_EN.md].\n\n**Analysis**\nTo apply a 0% VAT rate, Vingroup must meet the conditions specified in the regulations [Source: Doc_Undated_06_2012_TTBTC_EN.md]. However, the source documents do not explicitly state the conditions for applying a 0% VAT rate for exported software services [Source: Doc_Undated_219_2013_TTBTC_EN.md]. According to [Doc_Undated_219_2013_TTBTC_EN.md], this Circular guides taxable objects, non-taxable objects, taxpayers, tax bases, and tax calculation methods, but it does not provide specific guidance on the conditions for applying a 0% VAT rate [Source: Doc_Undated_219_2013_TTBTC_EN.md].\n\n**Recommendations**\nBased on the analysis, we recommend that Vingroup review the relevant regulations and seek guidance from the tax authorities to determine the specific conditions for applying a 0% VAT rate for exported software services [Source: Doc_Undated_06_2012_TTBTC_EN.md]. According to [Doc_Undated_06_2012_TTBTC_EN.md], the Ministry of Finance guides the implementation of the Law on Value-Added Tax, and it is essential to follow the official guidance and regulations [Source: Doc_Undated_06_2012_TTBTC_EN.md].\n\n**Risks**\nIf Vingroup fails to meet the conditions for applying a 0% VAT rate, it may be subject to penalties and interest on underpaid taxes [Source: Doc_Undated_129_2008_TTBTC_EN.md]. According to [Doc_Undated_129_2008_TTBTC_EN.md], VAT payers are responsible for paying VAT on taxable goods and services, and failure to comply with the regulations may result in tax liabilities [Source: Doc_Undated_129_2008_TTBTC_EN.md].\n\n**Sources**\n* [Doc_Undated_06_2012_TTBTC_EN.md]\n* [Doc_Undated_129_2008_TTBTC_EN.md]\n* [Doc_Undated_219_2013_TTBTC_EN.md]\n\nNote: The source documents do not address the specific conditions for applying a 0% VAT rate for exported software services [Source: Doc_Undated_219_2013_TTBTC_EN.md]. Therefore, we cannot provide a definitive answer to the client's request [Source: Doc_Undated_06_2012_TTBTC_EN.md]. We recommend seeking guidance from the tax authorities to ensure compliance with the regulations [Source: Doc_Undated_06_2012_TTBTC_EN.md].\n",
  "citations": [
    {
      "source": "Doc_Undated_06_2012_TTBTC_EN.md",
      "citations_count": 9,
      "content_length": 3000
    },
    {
      "source": "Doc_Undated_129_2008_TTBTC_EN.md",
      "citations_count": 4,
      "content_length": 3000
    },
    {
      "source": "Doc_Undated_219_2013_TTBTC_EN.md",
      "citations_count": 3,
      "content_length": 3000
    }
  ],
  "approval_status": "pending",
  "current_step": 6
}